lib/stripe_model_callbacks/fixtures/stripe_events/customer/customer.subscription.trial_will_end.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "customer.subscription.trial_will_end",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2018-01-23",
  "data": {
    "object": {
      "id": "sub_00000000000000",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1517919079,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1517919079,
      "current_period_end": 1520338279,
      "current_period_start": 1517919079,
      "customer": "cus_00000000000000",
      "days_until_due": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_CH3O9lDxhthMZ7",
            "object": "subscription_item",
            "created": 1517919080,
            "metadata": {
            },
            "plan": {
              "id": "silver-express-898",
              "object": "plan",
              "amount": 999,
              "created": 1506381458,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_BT1t06tZ3jBCHi",
              "trial_period_days": null,
              "statement_descriptor": null,
              "name": "Silver Express"
            },
            "quantity": 1,
            "subscription": "sub_CH3OnHOjKJvwcS"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_CH3OnHOjKJvwcS"
      },
      "livemode": false,
      "metadata": {
      },
      "plan": {
        "id": "silver-express-898_00000000000000",
        "object": "plan",
        "amount": 999,
        "created": 1506381458,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": null,
        "product": "prod_00000000000000",
        "trial_period_days": null,
        "statement_descriptor": null,
        "name": "Silver Express"
      },
      "quantity": 1,
      "start": 1517919079,
      "status": "trialing",
      "tax_percent": null,
      "trial_end": 1518176751,
      "trial_start": 1517917551
    }
  }
}
